qiweimao/ESP32-Datalogger/src/main.cpp
#include <WiFiClientSecure.h>
#include <PubSubClient.h>
#include <HardwareSerial.h>

#include "secrets.h"
#include "data_logging.h"
#include "utils.h"
#include "api_interface.h"
#include "vm_501.h"
#include "lora_init.h"

#if defined(ESP32)
#include <SD.h>
#include <SPIFFS.h>
#include <WiFi.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <FS.h>
#endif

#include "ESP-FTP-Server-Lib.h"
#include "FTPFilesystem.h"

#define FTP_USER     "esp32"
#define FTP_PASSWORD "esp32"

// #ifndef UNIT_TEST

FTPServer ftp;


/* Tasks */
SemaphoreHandle_t logMutex;
TaskHandle_t parsingTask; // Task handle for the parsing task
TaskHandle_t wifimanagerTaskHandle; // Task handle for the parsing task
TaskHandle_t blinkTaskHandle; // Task handle for the parsing task

void taskInitiNTP(void *parameter) {
  ntp_sync();  // Call the initNTP function
  Serial.println("Deleted NTP task");
  vTaskDelete(NULL);  // Delete the task once initialization is complete
}

void logDataTask(void *parameter) {
  while(true){
    LogErrorCode result = logData();
  }
}

void setup() {

  Serial.begin(115200);
  Serial.println("\n------------------Booting-------------------\n");

  /* Core System */
  Serial.println("*** Core System ***");
  wifi_setting_reset();
  pinMode(TRIGGER_PIN, INPUT_PULLUP);// Pin setting for wifi manager push button
  pinMode(LED,OUTPUT);// onboard blue LED inidcator
  spiffs_init();// Setup SPIFFS -- Flash File System

  sd_init();//SD card file system initialization
  load_system_configuration();
  
  external_rtc_init();// Initialize external RTC, MUST BE INITIALIZED BEFORE NTP
  oled_init();
  lora_init();

  wifi_init();
  start_http_server();// start Async server with api-interfaces

  // xTaskCreate(logDataTask, "logDataTask", 4096, NULL, 1, NULL);

  ftp.addUser(FTP_USER, FTP_PASSWORD);
  #if defined(ESP32)
    ftp.addFilesystem("SD", &SD);
  #endif
  ftp.addFilesystem("SPIFFS", &SPIFFS);
  ftp.begin();

  xTaskCreate(taskInitiNTP, "InitNTPTask", 4096, NULL, 1, NULL);
  /* Logging Capabilities */
  Serial.println("\n------------------Boot Completed----------------\n");
  Serial.println("Entering Loop");
}

int lora_counter = 0;

float getRamUsagePercentage() {
  // Get total heap size
  size_t totalHeap = ESP.getHeapSize();
  
  // Get free heap size
  size_t freeHeap = ESP.getFreeHeap();
  
  // Calculate used heap size
  size_t usedHeap = totalHeap - freeHeap;
  
  // Calculate percentage of used heap
  float usedHeapPercentage = (float(usedHeap) / totalHeap) * 100;
  
  Serial.printf("RAM Usage: %f\n", usedHeapPercentage);

  return usedHeapPercentage;
}

// boolean runEvery(unsigned long interval)
// {
//   static unsigned long previousMillis = 0;
//   unsigned long currentMillis = millis();
//   if (currentMillis - previousMillis >= interval)
//   {
//     previousMillis = currentMillis;
//     return true;
//   }
//   return false;
// }

void loop() {
  ftp.handle();
  ElegantOTA.loop();

  // int packetSize = LoRa.parsePacket();
  // if (packetSize) {
  //   Serial.print("Received packet '");

  //   while (LoRa.available()) {
  //     char c = (char)LoRa.read();
  //     Serial.print(c);
  //   }

  //   Serial.print("' with RSSI ");
  //   Serial.println(LoRa.packetRssi());
  // }
    // LoRa_rxMode();

}